powerfull/src/Documents/ОплатаУслугИАбонементов/ОплатаУслугИАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаУслугИАбонементов</name>
  <basedOn>Document.РеализацияУслуг</basedOn>
  <basedOn>Document.РеализацияАбонементов</basedOn>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Запись</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.Оплата</types>
    </type>
  </attributes>
</mdclass:Document>

powerfull/src/Documents/ОплатаУслугИАбонементов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияУслуг") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Запись = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		СпособОплаты = ДанныеЗаполнения.ТипОплаты;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияАбонементов") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Запись = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		СпособОплаты = ДанныеЗаполнения.ТипОплаты;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
